#include <iostream>
using namespace std;
int main(){

    /*ერთ კვადრატულ ქვეყანაში ცხოვრობდნენ კვადრატული ადამიანები და ყველაფერი დანარჩენიც იყო კვადრატული.
     ამრიგად, კვადრატულმა პარლამენტმა მიიღო კვადრატული მიწის კანონი. 
     ამ კანონის თანახმად, ადამიანს შეეძლო მხოლოდ კვადრატული მიწის შეძენა. 
     კვადრატული მიწის სიგრძეც და სიგანეც უნდა ყოფილიყო მთელი დადებითი რიცხვები. 
     თუ კვადრატული ადამიანი შეიძენდა მიწას, რომლის სიგრძეც იყო a მეტრი, მაშინ ის გადაიხდიდა a2 კვადრს.
     სანდრომ, რომელიც კვადრატული ქვეყნის მოქალაქეა, გადაწყვიტა მთელი მისი N კვადრით ეყიდა მიწა. 
     მას რა თქმა უნდა შეეძლო 1x1 ზომის მიწის ყიდვა, მაგრამ მას სურს, რომ მის მიერ ნაყიდი მიწების რაოდენობა რაც შეიძლება ცოტა გამოვიდეს.
     სანდრომ დახმარებისთვის თქვენ მოგმართათ, დაეხმარეთ მას და უთხარით თუ მინიმუმ რამდენი მიწის ყიდვა მოუწევს a კვადრით, ცხადია ფული ბოლომდე უნდა დაიხარჯოს.*/



/*შემავალი:
344

გამომავალი:
3*/


    // 344 = 324 + 20;
    //20 = 16 + 4;

    //41 = 36 + 5;
    //5 = 4 + 1;

    //41 = 36 + 4 + 1; 41 = 25 + 16;

    /*
    650 - 1^2
    650 - 2^2
    650 - 3^2

    650 - 20^2
    650 - 21^2
    
    
    
    
    
    
    */




    return 0;
}