#include <iostream>
#include <vector>
using namespace std;
int main(){

/*მდინარეზე ბორანით გადააქვთ სხვადასხვა ტვირთი. ბორანის ტვირთამწეობა უდრის M ტონას (M-ზე მეტი მასის მქონე ტვირთს ვერ უძლებს). 
მდინარესთან, მეორე ნაპირზე გადასატანად მოიტანეს N რაოდენობის სხვადასხვა ტვირთი, რომელთაგან თითოეულის მასა ცნობილია.
დაადგინეთ, მოხერხდება თუ არა ბორანის ერთი გადასვლით ყველა ტვირთის გადატანა მდინარის მეორე ნაპირზე.*/

/*შემავალი:
20 3
5 7 3

გამომავალი:
YES*/

/*შემავალი:
100 5
10 10 10 10 70

გამომავალი:
NO*/


    
    int n,m;
    cin >> n >> m;
    int sum = n + m;
    
    int arr_size;
    cin >> arr_size;

    int arr[arr_size];
    int sum_arr = 0;
    for(int i = 0; i<arr_size; i++){
        cin >> arr[i];
        sum_arr+=arr[i];
    }
    cout << sum_arr;
    







    return 0;
}
