#include <iostream>
#include <vector>
using namespace std;
int main(){

/*მოცემულია მთელი რიცხვებისგან შედგენილი N წევრიანი მასივი.
დაადგინეთ მასივის ყველა x-ის ტოლი ელემენტის ინდექსი და გამობეჭდეთ ზრდადობით,
ხოლო თუ ასეთი არცერთი ელემენტი არ მოიძებნა, მაშინ გამობეჭდეთ -1.
*მასივის ელემენტების დანომრვა 0-დან იწყება*/

/*შემავალი:
6 4
4 3 2 4 1 9

გამომავალი:
0 3*/

    int n,m;
    cin >> n >> m;
    int arr[n];
    for(int i = 0; i < n; i++){
        cin >> arr[i];
    }
    for(int i = 0; i<n; i++){
        if(arr[i] == m){
            cout << i;
            for(int j = i + 1; j < n; j++){
                if(arr[j] == m){
                    cout << " ";
                }
            }
        }
    }











    return 0;
}